[Killed] BlockStatement
src/example/ExampleData.ts:157:33
  * Schema resolvers for the fictional user service.
  */
 const userSchemaResolvers = {
-    _service(): { sdl: string } {
-        return { sdl: userSchemaSDL }
-    },
+    _service(): { sdl: string } {},
     coercedNullValueError(_input: unknown): LoginData {
         throw new GraphQLError(coercedNullValueError, {})
killedBy: Should be able to execute requests against user test schema
statusReason: expected { _service: null } to deeply equal { Object (_service) }

[Killed] ObjectLiteral
src/example/ExampleData.ts:158:16
  */
 const userSchemaResolvers = {
     _service(): { sdl: string } {
-        return { sdl: userSchemaSDL }
+        return {}
     },
     coercedNullValueError(_input: unknown): LoginData {
killedBy: Should be able to execute requests against user test schema
statusReason: expected { _service: { sdl: null } } to deeply equal { Object (_service) }

[Killed] BlockStatement
src/example/ExampleData.ts:160:55
     _service(): { sdl: string } {
         return { sdl: userSchemaSDL }
     },
-    coercedNullValueError(_input: unknown): LoginData {
-        throw new GraphQLError(coercedNullValueError, {})
-    },
+    coercedNullValueError(_input: unknown): LoginData {},
     fetchError(): User {
         throw new GraphQLError('Request failed ETIMEDOUT connection failed', {})
killedBy: Should be able to execute requests against user test schema
statusReason: expected undefined to deeply equal 'Variable \'userName\' has an invalid …'

[Killed] BlockStatement
src/example/ExampleData.ts:163:24
     coercedNullValueError(_input: unknown): LoginData {
         throw new GraphQLError(coercedNullValueError, {})
     },
-    fetchError(): User {
-        throw new GraphQLError('Request failed ETIMEDOUT connection failed', {})
-    },
+    fetchError(): User {},
     login(input: unknown, context: Record<string, unknown>): LoginData {
         let jwtValue = 'jwt-'
killedBy: Should be able to execute requests against user test schema
statusReason: expected undefined to deeply equal 'Request failed ETIMEDOUT connection f…'

[Killed] BlockStatement
src/example/ExampleData.ts:166:72
     fetchError(): User {
         throw new GraphQLError('Request failed ETIMEDOUT connection failed', {})
     },
-    login(input: unknown, context: Record<string, unknown>): LoginData {
-        let jwtValue = 'jwt-'
-        if (context && context.authHeader) {
-            jwtValue += context.authHeader
-            context.jwt = jwtValue
-        }
-        return { jwt: jwtValue }
-    },
+    login(input: unknown, context: Record<string, unknown>): LoginData {},
     logout(): LogoutResult {
         return { result: 'Goodbye!' }
killedBy: Should be able to execute requests against user test schema
statusReason: expected { login: null } to deeply equal { login: { jwt: 'jwt-' } }

[Killed] LogicalOperator
src/example/ExampleData.ts:168:13
     },
     login(input: unknown, context: Record<string, unknown>): LoginData {
         let jwtValue = 'jwt-'
-        if (context && context.authHeader) {
+        if (context || context.authHeader) {
             jwtValue += context.authHeader
             context.jwt = jwtValue
killedBy: Should be able to execute requests against user test schema
statusReason: expected { login: null } to deeply equal { login: { jwt: 'jwt-' } }

[Killed] BlockStatement
src/example/ExampleData.ts:168:44
     },
     login(input: unknown, context: Record<string, unknown>): LoginData {
         let jwtValue = 'jwt-'
-        if (context && context.authHeader) {
-            jwtValue += context.authHeader
-            context.jwt = jwtValue
-        }
+        if (context && context.authHeader) {}
         return { jwt: jwtValue }
     },
killedBy: Should be able to execute requests against user test schema
statusReason: expected { login: { jwt: 'jwt-' } } to deeply equal { login: { jwt: 'jwt-MYJWT' } }

[Killed] AssignmentOperator
src/example/ExampleData.ts:169:13
     login(input: unknown, context: Record<string, unknown>): LoginData {
         let jwtValue = 'jwt-'
         if (context && context.authHeader) {
-            jwtValue += context.authHeader
+            jwtValue -= context.authHeader
             context.jwt = jwtValue
         }
killedBy: Should be able to execute requests against user test schema
statusReason: expected { login: { jwt: null } } to deeply equal { login: { jwt: 'jwt-MYJWT' } }

[Killed] BlockStatement
src/example/ExampleData.ts:174:28
         }
         return { jwt: jwtValue }
     },
-    logout(): LogoutResult {
-        return { result: 'Goodbye!' }
-    },
+    logout(): LogoutResult {},
     returnError(): User {
         throw new GraphQLError('Something went wrong!', {})
killedBy: Should be able to execute requests against user test schema
statusReason: expected { logout: null } to deeply equal { logout: { result: 'Goodbye!' } }

[Killed] StringLiteral
src/example/ExampleData.ts:175:26
         return { jwt: jwtValue }
     },
     logout(): LogoutResult {
-        return { result: 'Goodbye!' }
+        return { result: "" }
     },
     returnError(): User {
killedBy: Should be able to execute requests against user test schema
statusReason: expected { logout: { result: '' } } to deeply equal { logout: { result: 'Goodbye!' } }

[Killed] ObjectLiteral
src/example/ExampleData.ts:175:16
         return { jwt: jwtValue }
     },
     logout(): LogoutResult {
-        return { result: 'Goodbye!' }
+        return {}
     },
     returnError(): User {
killedBy: Should be able to execute requests against user test schema
statusReason: expected { logout: { result: null } } to deeply equal { logout: { result: 'Goodbye!' } }

[Killed] BlockStatement
src/example/ExampleData.ts:177:25
     logout(): LogoutResult {
         return { result: 'Goodbye!' }
     },
-    returnError(): User {
-        throw new GraphQLError('Something went wrong!', {})
-    },
+    returnError(): User {},
     sensitiveDataError(): User {
         throw new GraphQLError(sensitiveDataInError, {})
killedBy: Should be able to execute requests against user test schema
statusReason: expected undefined to deeply equal 'Something went wrong!'

[Killed] BlockStatement
src/example/ExampleData.ts:180:32
     returnError(): User {
         throw new GraphQLError('Something went wrong!', {})
     },
-    sensitiveDataError(): User {
-        throw new GraphQLError(sensitiveDataInError, {})
-    },
+    sensitiveDataError(): User {},
     user(input: { id: string }): User {
         switch (input.id) {
killedBy: Should be able to execute requests against user test schema
statusReason: expected undefined to deeply equal 'invalid value : invalid value : inval…'

[Killed] BlockStatement
src/example/ExampleData.ts:183:39
     sensitiveDataError(): User {
         throw new GraphQLError(sensitiveDataInError, {})
     },
-    user(input: { id: string }): User {
-        switch (input.id) {
-            case '1':
-                return userOne
-            case '2':
-                return userTwo
-            default:
-                throw new GraphQLError(
-                    `User for userid=${input.id} was not found`,
-                    {},
-                )
-        }
-    },
+    user(input: { id: string }): User {},
     users(): User[] {
         return [userOne, userTwo]
killedBy: Should be able to execute requests against user test schema
statusReason: expected { user: null } to deeply equal { user: { userId: '1', …(1) } }

[Killed] ConditionalExpression
src/example/ExampleData.ts:185:13
     },
     user(input: { id: string }): User {
         switch (input.id) {
-            case '1':
-                return userOne
+            case '1':
             case '2':
                 return userTwo
killedBy: Should be able to execute requests against user test schema
statusReason: expected { user: { userId: '2', …(1) } } to deeply equal { user: { userId: '1', …(1) } }

[Killed] ConditionalExpression
src/example/ExampleData.ts:187:13
         switch (input.id) {
             case '1':
                 return userOne
-            case '2':
-                return userTwo
+            case '2':
             default:
                 throw new GraphQLError(
killedBy: Should be able to execute requests against user test schema
statusReason: expected { user: null } to deeply equal { user: { userId: '2', …(1) } }

[Killed] ConditionalExpression
src/example/ExampleData.ts:189:13
                 return userOne
             case '2':
                 return userTwo
-            default:
-                throw new GraphQLError(
-                    `User for userid=${input.id} was not found`,
-                    {},
-                )
+            default:
         }
     },
killedBy: Should be able to execute requests against user test schema
statusReason: expected undefined to deeply equal 'User for userid=3 was not found'

[Killed] StringLiteral
src/example/ExampleData.ts:191:21
                 return userTwo
             default:
                 throw new GraphQLError(
-                    `User for userid=${input.id} was not found`,
+                    ``,
                     {},
                 )
killedBy: Should be able to execute requests against user test schema
statusReason: expected '' to deeply equal 'User for userid=3 was not found'

[Killed] BlockStatement
src/example/ExampleData.ts:196:21
                 )
         }
     },
-    users(): User[] {
-        return [userOne, userTwo]
-    },
+    users(): User[] {},
     validationError(): User {
         throw validationError
killedBy: Should be able to execute requests against user test schema
statusReason: expected { users: null } to deeply equal { users: [ …(2) ] }

[Killed] BlockStatement
src/example/ExampleData.ts:199:29
     users(): User[] {
         return [userOne, userTwo]
     },
-    validationError(): User {
-        throw validationError
-    },
+    validationError(): User {},
 }
 
killedBy: Should be able to execute requests against user test schema
statusReason: expected undefined to deeply equal 'Cannot query field "userId" on type "…'
