[Killed] StringLiteral
src/logger/JsonTestLogger.ts:16:19
 export class JsonTestLogger implements Logger {
     loggerName = 'test-logger'
     debugEnabled: boolean
-    serviceName = 'myTestService'
+    serviceName = ""
     logEntries: LogEntry[] = new Array<LogEntry>()
 
killedBy: Creating a Logger should work with default options
statusReason: expected '' to be 'myTestService' // Object.is equality

[Killed] ArrayDeclaration
src/logger/JsonTestLogger.ts:17:30
     loggerName = 'test-logger'
     debugEnabled: boolean
     serviceName = 'myTestService'
-    logEntries: LogEntry[] = new Array<LogEntry>()
+    logEntries: LogEntry[] = new Array([])
 
     constructor(debugEnabled = false) {
killedBy: Logging entry should work even if no loglevel is provided
statusReason: expected undefined to be 'test' // Object.is equality

[Killed] BlockStatement
src/logger/JsonTestLogger.ts:19:39
     serviceName = 'myTestService'
     logEntries: LogEntry[] = new Array<LogEntry>()
 
-    constructor(debugEnabled = false) {
-        this.debugEnabled = debugEnabled
-    }
+    constructor(debugEnabled = false) {}
 
     debug(
killedBy: Creating a Logger should work with default options
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/logger/JsonTestLogger.ts:19:32
     serviceName = 'myTestService'
     logEntries: LogEntry[] = new Array<LogEntry>()
 
-    constructor(debugEnabled = false) {
+    constructor(debugEnabled = true) {
         this.debugEnabled = debugEnabled
     }
killedBy: Creating a Logger should work with default options
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/logger/JsonTestLogger.ts:27:13
         logMessage: string,
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
-    ): void {
-        if (this.debugEnabled) {
-            this.createLogEntry({
-                context,
-                dateFunction,
-                logMessage,
-                loglevel: 'DEBUG',
-            })
-        }
-    }
+    ): void {}
 
     error(
killedBy: Debug entry should be written if debug is enabled
statusReason: expected undefined to be 'test' // Object.is equality

[Killed] BlockStatement
src/logger/JsonTestLogger.ts:28:32
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        if (this.debugEnabled) {
-            this.createLogEntry({
-                context,
-                dateFunction,
-                logMessage,
-                loglevel: 'DEBUG',
-            })
-        }
+        if (this.debugEnabled) {}
     }
 
killedBy: Debug entry should be written if debug is enabled
statusReason: expected undefined to be 'test' // Object.is equality

[Killed] BlockStatement
src/logger/JsonTestLogger.ts:44:13
         error: Error,
         customErrorName: string,
         dateFunction?: DateFunction,
-    ): void {
-        this.createLogEntry({
-            context,
-            customErrorName,
-            dateFunction,
-            error,
-            logMessage,
-            loglevel: 'ERROR',
-        })
-    }
+    ): void {}
 
     info(
killedBy: Error entry should be written
statusReason: expected undefined to be 'ERROR' // Object.is equality

[Killed] StringLiteral
src/logger/JsonTestLogger.ts:51:23
             dateFunction,
             error,
             logMessage,
-            loglevel: 'ERROR',
+            loglevel: "",
         })
     }
killedBy: Error entry should be written
statusReason: expected '' to be 'ERROR' // Object.is equality

[Killed] BlockStatement
src/logger/JsonTestLogger.ts:59:13
         logMessage: string,
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
-    ): void {
-        this.createLogEntry({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'INFO',
-        })
-    }
+    ): void {}
 
     warn(
killedBy: Info entry should be written
statusReason: expected undefined to be 'INFO' // Object.is equality

[Killed] BlockStatement
src/logger/JsonTestLogger.ts:72:13
         logMessage: string,
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
-    ): void {
-        this.createLogEntry({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'WARN',
-        })
-    }
+    ): void {}
 
     createLogEntry(logEntryInput: LogEntryInput): void {
killedBy: Warn entry should be written
statusReason: expected undefined to be 'WARN' // Object.is equality

[Killed] BlockStatement
src/logger/JsonTestLogger.ts:81:56
         })
     }
 
-    createLogEntry(logEntryInput: LogEntryInput): void {
-        const logEntry: LogEntry = {
-            errorName: logEntryInput.customErrorName,
-            level: logEntryInput.loglevel ?? 'INFO',
-            logger: this.loggerName,
-            message: logEntryInput.logMessage,
-            serviceName: this.serviceName,
-            stacktrace: logEntryInput.error?.stack ? 'stacktrace' : undefined,
-            timestamp: testDateString,
-        }
-        this.logEntries.push(logEntry)
-    }
+    createLogEntry(logEntryInput: LogEntryInput): void {}
 }
 
killedBy: Logging entry should work even if no loglevel is provided
statusReason: expected undefined to be 'test' // Object.is equality

[Killed] LogicalOperator
src/logger/JsonTestLogger.ts:84:20
     createLogEntry(logEntryInput: LogEntryInput): void {
         const logEntry: LogEntry = {
             errorName: logEntryInput.customErrorName,
-            level: logEntryInput.loglevel ?? 'INFO',
+            level: logEntryInput.loglevel && 'INFO',
             logger: this.loggerName,
             message: logEntryInput.logMessage,
killedBy: Logging entry should work even if no loglevel is provided
statusReason: expected undefined to be 'INFO' // Object.is equality

[Killed] OptionalChaining
src/logger/JsonTestLogger.ts:88:25
             logger: this.loggerName,
             message: logEntryInput.logMessage,
             serviceName: this.serviceName,
-            stacktrace: logEntryInput.error?.stack ? 'stacktrace' : undefined,
+            stacktrace: logEntryInput.error.stack ? 'stacktrace' : undefined,
             timestamp: testDateString,
         }
killedBy: Logging entry should work even if no loglevel is provided
statusReason: Cannot read properties of undefined (reading 'stack')
