[Killed] BlockStatement
src/logger/NoOpLogger.ts:18:58
      * @param {string} loggerName - The logger name of the logger.
      * @param {string} serviceName - The service name of the logger.
      */
-    constructor(loggerName: string, serviceName: string) {
-        this.loggerName = loggerName
-        this.serviceName = serviceName
-        this.debugEnabled = false
-    }
+    constructor(loggerName: string, serviceName: string) {}
     debug(
         logMessage: string,
killedBy: Should be able to use NoLogger without running into errors
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/logger/NoOpLogger.ts:21:29
     constructor(loggerName: string, serviceName: string) {
         this.loggerName = loggerName
         this.serviceName = serviceName
-        this.debugEnabled = false
+        this.debugEnabled = true
     }
     debug(
killedBy: Should be able to use NoLogger without running into errors
statusReason: expected true to be false // Object.is equality
