[Killed] ObjectLiteral
src/logger/TextTestLogger.ts:29:33
         dateFunction?: DateFunction,
     ): void {
         if (this.debugEnabled) {
-            this.createLogEntry({
-                context,
-                dateFunction,
-                logMessage,
-                loglevel: 'DEBUG',
-            })
+            this.createLogEntry({})
         }
     }
killedBy: Debug entry should be written if debug is enabled
statusReason: expected '1001-01-01T00:00:00.000Z [INFO]test-l…' to be '1001-01-01T00:00:00.000Z [DEBUG]test-…' // Object.is equality

[Killed] ObjectLiteral
src/logger/TextTestLogger.ts:60:29
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        this.createLogEntry({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'INFO',
-        })
+        this.createLogEntry({})
     }
 
killedBy: Info entry should be written
statusReason: expected '1001-01-01T00:00:00.000Z [INFO]test-l…' to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality

[Killed] ObjectLiteral
src/logger/TextTestLogger.ts:73:29
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        this.createLogEntry({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'WARN',
-        })
+        this.createLogEntry({})
     }
 
killedBy: Warn entry should be written
statusReason: expected '1001-01-01T00:00:00.000Z [INFO]test-l…' to be '1001-01-01T00:00:00.000Z [WARN]test-l…' // Object.is equality

[Killed] BlockStatement
src/logger/TextTestLogger.ts:81:56
         })
     }
 
-    createLogEntry(logEntryInput: LogEntryInput): void {
-        const logEntry: LogEntry = {
-            errorName: logEntryInput.customErrorName,
-            level: logEntryInput.loglevel ?? 'INFO',
-            logger: this.loggerName,
-            message: logEntryInput.logMessage,
-            serviceName: this.serviceName,
-            stacktrace: logEntryInput.error?.stack ? 'stacktrace' : undefined,
-            timestamp: testDateString,
-        }
-        this.logEntries.push(
-            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
-                `${this.loggerName}-${this.serviceName} :` +
-                logEntry.message +
-                (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : ''),
-        )
-    }
+    createLogEntry(logEntryInput: LogEntryInput): void {}
 }
 
killedBy: Logging entry should work even if no loglevel is provided
statusReason: expected undefined to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality

[Killed] ObjectLiteral
src/logger/TextTestLogger.ts:82:36
     }
 
     createLogEntry(logEntryInput: LogEntryInput): void {
-        const logEntry: LogEntry = {
-            errorName: logEntryInput.customErrorName,
-            level: logEntryInput.loglevel ?? 'INFO',
-            logger: this.loggerName,
-            message: logEntryInput.logMessage,
-            serviceName: this.serviceName,
-            stacktrace: logEntryInput.error?.stack ? 'stacktrace' : undefined,
-            timestamp: testDateString,
-        }
+        const logEntry: LogEntry = {}
         this.logEntries.push(
             `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
killedBy: Logging entry should work even if no loglevel is provided
statusReason: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] ArithmeticOperator
src/logger/TextTestLogger.ts:92:13
             timestamp: testDateString,
         }
         this.logEntries.push(
-            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
-                `${this.loggerName}-${this.serviceName} :` +
-                logEntry.message +
-                (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : ''),
+            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` + `${this.loggerName}-${this.serviceName} :` + logEntry.message - (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : ''),
         )
     }
killedBy: Logging entry should work even if no loglevel is provided
statusReason: expected NaN to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality

[Killed] MethodExpression
src/logger/TextTestLogger.ts:92:39
             timestamp: testDateString,
         }
         this.logEntries.push(
-            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
+            `${logEntry.timestamp} [${logEntry.level.toLowerCase()}]` +
                 `${this.loggerName}-${this.serviceName} :` +
                 logEntry.message +
killedBy: Logging entry should work even if no loglevel is provided
statusReason: expected '1001-01-01T00:00:00.000Z [info]test-l…' to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality

[Killed] StringLiteral
src/logger/TextTestLogger.ts:93:17
         }
         this.logEntries.push(
             `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
-                `${this.loggerName}-${this.serviceName} :` +
+                `` +
                 logEntry.message +
                 (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : ''),
killedBy: Logging entry should work even if no loglevel is provided
statusReason: expected '1001-01-01T00:00:00.000Z [INFO]test' to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality

[Killed] StringLiteral
src/logger/TextTestLogger.ts:95:40
             `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
                 `${this.loggerName}-${this.serviceName} :` +
                 logEntry.message +
-                (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : ''),
+                (logEntry.stacktrace ? `` : ''),
         )
     }
killedBy: Error entry should be written
statusReason: expected '1001-01-01T00:00:00.000Z [ERROR]test-…' to be '1001-01-01T00:00:00.000Z [ERROR]test-…' // Object.is equality
