[Killed] BlockStatement
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:10:11
  */
 export function generateGetParametersFromGraphQLRequestInfo(
     requestInfo: GraphQLRequestInfo,
-): string {
-    let result = ''
-    if (requestInfo.query) {
-        result += `query=${requestInfo.query}&`
-    }
-    if (requestInfo.operationName) {
-        result += `operationName=${requestInfo.operationName}&`
-    }
-    if (requestInfo.variables) {
-        result += `variables=${JSON.stringify(requestInfo.variables)}`
-    }
-    if (result.endsWith('&')) {
-        result = result.slice(0, -1)
-    }
-    return encodeURI(result)
-}
+): string {}
 
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables 'testVars' the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected undefined to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] ConditionalExpression
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:12:9
     requestInfo: GraphQLRequestInfo,
 ): string {
     let result = ''
-    if (requestInfo.query) {
+    if (true) {
         result += `query=${requestInfo.query}&`
     }
killedBy: For the given query undefined , operation name 'testOpName' and variables 'testVars' the expected parameters are created 'operationName=testOpName&variables=%2…'
statusReason: expected 'query=undefined&operationName=testOpN…' to be 'operationName=testOpName&variables=%2…' // Object.is equality

[Killed] BlockStatement
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:12:28
     requestInfo: GraphQLRequestInfo,
 ): string {
     let result = ''
-    if (requestInfo.query) {
-        result += `query=${requestInfo.query}&`
-    }
+    if (requestInfo.query) {}
     if (requestInfo.operationName) {
         result += `operationName=${requestInfo.operationName}&`
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables 'testVars' the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'operationName=testOpName&variables=%2…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] ConditionalExpression
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:15:9
     if (requestInfo.query) {
         result += `query=${requestInfo.query}&`
     }
-    if (requestInfo.operationName) {
+    if (false) {
         result += `operationName=${requestInfo.operationName}&`
     }
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables 'testVars' the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'query=testQuery&variables=%22testVars…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] ConditionalExpression
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:15:9
     if (requestInfo.query) {
         result += `query=${requestInfo.query}&`
     }
-    if (requestInfo.operationName) {
+    if (true) {
         result += `operationName=${requestInfo.operationName}&`
     }
killedBy: For the given query 'testQuery' , operation name undefined and variables 'testVars' the expected parameters are created 'query=testQuery&variables=%22testVars…'
statusReason: expected 'query=testQuery&operationName=undefin…' to be 'query=testQuery&variables=%22testVars…' // Object.is equality

[Killed] BlockStatement
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:18:32
     if (requestInfo.operationName) {
         result += `operationName=${requestInfo.operationName}&`
     }
-    if (requestInfo.variables) {
-        result += `variables=${JSON.stringify(requestInfo.variables)}`
-    }
+    if (requestInfo.variables) {}
     if (result.endsWith('&')) {
         result = result.slice(0, -1)
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables 'testVars' the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'query=testQuery&operationName=testOpN…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] ConditionalExpression
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:18:9
     if (requestInfo.operationName) {
         result += `operationName=${requestInfo.operationName}&`
     }
-    if (requestInfo.variables) {
+    if (true) {
         result += `variables=${JSON.stringify(requestInfo.variables)}`
     }
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables undefined the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'query=testQuery&operationName=testOpN…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] StringLiteral
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:19:19
         result += `operationName=${requestInfo.operationName}&`
     }
     if (requestInfo.variables) {
-        result += `variables=${JSON.stringify(requestInfo.variables)}`
+        result += ``
     }
     if (result.endsWith('&')) {
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables 'testVars' the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'query=testQuery&operationName=testOpN…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] ConditionalExpression
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:21:9
     if (requestInfo.variables) {
         result += `variables=${JSON.stringify(requestInfo.variables)}`
     }
-    if (result.endsWith('&')) {
+    if (false) {
         result = result.slice(0, -1)
     }
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables undefined the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'query=testQuery&operationName=testOpN…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] MethodExpression
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:21:9
     if (requestInfo.variables) {
         result += `variables=${JSON.stringify(requestInfo.variables)}`
     }
-    if (result.endsWith('&')) {
+    if (result.startsWith('&')) {
         result = result.slice(0, -1)
     }
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables undefined the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'query=testQuery&operationName=testOpN…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] MethodExpression
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:22:18
         result += `variables=${JSON.stringify(requestInfo.variables)}`
     }
     if (result.endsWith('&')) {
-        result = result.slice(0, -1)
+        result = result
     }
     return encodeURI(result)
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables undefined the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'query=testQuery&operationName=testOpN…' to be 'query=testQuery&operationName=testOpN…' // Object.is equality

[Killed] UnaryOperator
src/request/GenerateGetParametersFromGraphQLRequestInfo.ts:22:34
         result += `variables=${JSON.stringify(requestInfo.variables)}`
     }
     if (result.endsWith('&')) {
-        result = result.slice(0, -1)
+        result = result.slice(0, +1)
     }
     return encodeURI(result)
killedBy: For the given query 'testQuery' , operation name 'testOpName' and variables undefined the expected parameters are created 'query=testQuery&operationName=testOpN…'
statusReason: expected 'q' to be 'query=testQuery&operationName=testOpN…' // Object.is equality
