[Killed] BlockStatement
src/request/RequestForQuery.ts:14:25
 export function requestForQuery(
     query: string,
     headers: IncomingHttpHeaders = JsonContentTypeHeader,
-): GraphQLServerRequest {
-    return {
-        body: `{"query":"${query}"}`,
-        headers: headers,
-        method: 'POST',
-        text: async () => `{"query":"${query}"}`,
-        url: '/graphql',
-    }
-}
+): GraphQLServerRequest {}
 
killedBy: For the given query 'query users{ users { userId userName …' and headers undefined the expected Request object is created with body undefined
statusReason: Cannot read properties of undefined (reading 'body')

[Killed] StringLiteral
src/request/RequestForQuery.ts:16:15
     headers: IncomingHttpHeaders = JsonContentTypeHeader,
 ): GraphQLServerRequest {
     return {
-        body: `{"query":"${query}"}`,
+        body: ``,
         headers: headers,
         method: 'POST',
killedBy: For the given query 'query users{ users { userId userName …' and headers undefined the expected Request object is created with body undefined
statusReason: expected '' to strictly equal '{"query":"query users{ users { userId…'

[Killed] StringLiteral
src/request/RequestForQuery.ts:18:17
     return {
         body: `{"query":"${query}"}`,
         headers: headers,
-        method: 'POST',
+        method: "",
         text: async () => `{"query":"${query}"}`,
         url: '/graphql',
killedBy: For the given query 'query users{ users { userId userName …' and headers undefined the expected Request object is created with body undefined
statusReason: expected '' to strictly equal 'POST'

[Killed] ArrowFunction
src/request/RequestForQuery.ts:19:15
         body: `{"query":"${query}"}`,
         headers: headers,
         method: 'POST',
-        text: async () => `{"query":"${query}"}`,
+        text: () => undefined,
         url: '/graphql',
     }
killedBy: For the given query 'query users{ users { userId userName …' and headers undefined the expected Request object is created with body undefined
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] StringLiteral
src/request/RequestForQuery.ts:19:27
         body: `{"query":"${query}"}`,
         headers: headers,
         method: 'POST',
-        text: async () => `{"query":"${query}"}`,
+        text: async () => ``,
         url: '/graphql',
     }
killedBy: For the given query 'query users{ users { userId userName …' and headers undefined the expected Request object is created with body undefined
statusReason: expected '' to strictly equal '{"query":"query users{ users { userId…'

[Killed] StringLiteral
src/request/RequestForQuery.ts:20:14
         headers: headers,
         method: 'POST',
         text: async () => `{"query":"${query}"}`,
-        url: '/graphql',
+        url: "",
     }
 }
killedBy: For the given query 'query users{ users { userId userName …' and headers undefined the expected Request object is created with body undefined
statusReason: expected '' to strictly equal '/graphql'
