[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponse.ts:7:79
  * GraphQLServerResponse implementation that can be used standalone without a webserver
  */
 export class StandaloneGraphQLServerResponse extends StandaloneGraphQLServerResponseCompat {
-    setHeader(name: string, value: string | number | readonly string[]): this {
-        this.headers.set(name.toLocaleLowerCase(), value)
-        return this
-    }
+    setHeader(name: string, value: string | number | readonly string[]): this {}
     end(chunk: unknown): this {
         this.responses.push(chunk)
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'application/text' // Object.is equality

[Killed] MethodExpression
src/response/StandaloneGraphQLServerResponse.ts:8:26
  */
 export class StandaloneGraphQLServerResponse extends StandaloneGraphQLServerResponseCompat {
     setHeader(name: string, value: string | number | readonly string[]): this {
-        this.headers.set(name.toLocaleLowerCase(), value)
+        this.headers.set(name.toLocaleUpperCase(), value)
         return this
     }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'application/text' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponse.ts:11:31
         this.headers.set(name.toLocaleLowerCase(), value)
         return this
     }
-    end(chunk: unknown): this {
-        this.responses.push(chunk)
-        return this
-    }
+    end(chunk: unknown): this {}
 }
 
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality
