[Killed] ArrayDeclaration
src/response/StandaloneGraphQLServerResponseCompat.ts:17:28
     /**
      * Set responses in an unknown array
      */
-    responses: unknown[] = []
+    responses: unknown[] = ["Stryker was here"]
 
     textDecoder: TextDecoder = new TextDecoder()
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected [ 'Stryker was here' ] to strictly equal []

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:21:76
 
     textDecoder: TextDecoder = new TextDecoder()
 
-    header(name: string, value: string | number | readonly string[]): this {
-        this.headers.set(name.toLocaleLowerCase(), value)
-        return this
-    }
+    header(name: string, value: string | number | readonly string[]): this {}
     send(chunk: unknown): this {
         this.responses.push(chunk)
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected 'application/text' to be 'application/json' // Object.is equality

[Killed] MethodExpression
src/response/StandaloneGraphQLServerResponseCompat.ts:22:26
     textDecoder: TextDecoder = new TextDecoder()
 
     header(name: string, value: string | number | readonly string[]): this {
-        this.headers.set(name.toLocaleLowerCase(), value)
+        this.headers.set(name.toLocaleUpperCase(), value)
         return this
     }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected 'application/text' to be 'application/json' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:25:32
         this.headers.set(name.toLocaleLowerCase(), value)
         return this
     }
-    send(chunk: unknown): this {
-        this.responses.push(chunk)
-        return this
-    }
+    send(chunk: unknown): this {}
     removeHeader(name: string): void {
         this.headers.delete(name)
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected 'Hello, World!' to be 'Hello, World 2nd!' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:29:38
         this.responses.push(chunk)
         return this
     }
-    removeHeader(name: string): void {
-        this.headers.delete(name)
-    }
+    removeHeader(name: string): void {}
 
     /**
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected 'application/json' to be undefined

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:37:31
      * Returns the last response as a string
      * @returns {string} The last response as a string
      */
-    getLastResponse(): string {
-        const response = this.responses.at(-1)
-        if (response instanceof Uint8Array) {
-            return this.textDecoder.decode(response)
-        } else if (typeof response === 'string') {
-            return response
-        }
-        return JSON.stringify(response)
-    }
+    getLastResponse(): string {}
 
     /**
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] UnaryOperator
src/response/StandaloneGraphQLServerResponseCompat.ts:38:44
      * @returns {string} The last response as a string
      */
     getLastResponse(): string {
-        const response = this.responses.at(-1)
+        const response = this.responses.at(+1)
         if (response instanceof Uint8Array) {
             return this.textDecoder.decode(response)
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] ConditionalExpression
src/response/StandaloneGraphQLServerResponseCompat.ts:39:13
      */
     getLastResponse(): string {
         const response = this.responses.at(-1)
-        if (response instanceof Uint8Array) {
+        if (true) {
             return this.textDecoder.decode(response)
         } else if (typeof response === 'string') {
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected '' to be undefined // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:39:45
      */
     getLastResponse(): string {
         const response = this.responses.at(-1)
-        if (response instanceof Uint8Array) {
-            return this.textDecoder.decode(response)
-        } else if (typeof response === 'string') {
+        if (response instanceof Uint8Array) {} else if (typeof response === 'string') {
             return response
         }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected '{"type":"Buffer","data":[72,101,108,1…' to be 'Hello, World!' // Object.is equality

[Killed] ConditionalExpression
src/response/StandaloneGraphQLServerResponseCompat.ts:41:20
         const response = this.responses.at(-1)
         if (response instanceof Uint8Array) {
             return this.textDecoder.decode(response)
-        } else if (typeof response === 'string') {
+        } else if (false) {
             return response
         }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected '"Hello, World!"' to be 'Hello, World!' // Object.is equality

[Killed] EqualityOperator
src/response/StandaloneGraphQLServerResponseCompat.ts:41:20
         const response = this.responses.at(-1)
         if (response instanceof Uint8Array) {
             return this.textDecoder.decode(response)
-        } else if (typeof response === 'string') {
+        } else if (typeof response !== 'string') {
             return response
         }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected '"Hello, World!"' to be 'Hello, World!' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:53:60
      * @returns {string} The last response as a string
      */
     // eslint-disable-next-line no-explicit-any
-    getLastResponseAsObject(parseStringToJSON = true): any {
-        const response = this.responses.at(-1)
-        if (typeof response === 'string' && parseStringToJSON) {
-            try {
-                return JSON.parse(response)
-            } catch {
-                return response
-            }
-        } else if (response instanceof Uint8Array) {
-            const decodedResponse = this.textDecoder.decode(response)
-            try {
-                return JSON.parse(decodedResponse)
-            } catch {
-                return decodedResponse
-            }
-        } else {
-            return response
-        }
-    }
+    getLastResponseAsObject(parseStringToJSON = true): any {}
 }
 
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] BooleanLiteral
src/response/StandaloneGraphQLServerResponseCompat.ts:53:49
      * @returns {string} The last response as a string
      */
     // eslint-disable-next-line no-explicit-any
-    getLastResponseAsObject(parseStringToJSON = true): any {
+    getLastResponseAsObject(parseStringToJSON = false): any {
         const response = this.responses.at(-1)
         if (typeof response === 'string' && parseStringToJSON) {
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'AValue' // Object.is equality

[Killed] UnaryOperator
src/response/StandaloneGraphQLServerResponseCompat.ts:54:44
      */
     // eslint-disable-next-line no-explicit-any
     getLastResponseAsObject(parseStringToJSON = true): any {
-        const response = this.responses.at(-1)
+        const response = this.responses.at(+1)
         if (typeof response === 'string' && parseStringToJSON) {
             try {
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:55:64
     // eslint-disable-next-line no-explicit-any
     getLastResponseAsObject(parseStringToJSON = true): any {
         const response = this.responses.at(-1)
-        if (typeof response === 'string' && parseStringToJSON) {
-            try {
-                return JSON.parse(response)
-            } catch {
-                return response
-            }
-        } else if (response instanceof Uint8Array) {
+        if (typeof response === 'string' && parseStringToJSON) {} else if (response instanceof Uint8Array) {
             const decodedResponse = this.textDecoder.decode(response)
             try {
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] ConditionalExpression
src/response/StandaloneGraphQLServerResponseCompat.ts:55:13
     // eslint-disable-next-line no-explicit-any
     getLastResponseAsObject(parseStringToJSON = true): any {
         const response = this.responses.at(-1)
-        if (typeof response === 'string' && parseStringToJSON) {
+        if (false) {
             try {
                 return JSON.parse(response)
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'AValue' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:56:17
     getLastResponseAsObject(parseStringToJSON = true): any {
         const response = this.responses.at(-1)
         if (typeof response === 'string' && parseStringToJSON) {
-            try {
-                return JSON.parse(response)
-            } catch {
+            try {} catch {
                 return response
             }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:58:21
         if (typeof response === 'string' && parseStringToJSON) {
             try {
                 return JSON.parse(response)
-            } catch {
-                return response
-            }
+            } catch {}
         } else if (response instanceof Uint8Array) {
             const decodedResponse = this.textDecoder.decode(response)
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] ConditionalExpression
src/response/StandaloneGraphQLServerResponseCompat.ts:61:20
             } catch {
                 return response
             }
-        } else if (response instanceof Uint8Array) {
+        } else if (false) {
             const decodedResponse = this.textDecoder.decode(response)
             try {
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected Buffer[ 72, 101, 108, 108, 111, …(-30) ] to be 'Hello, World!' // Object.is equality

[Killed] ConditionalExpression
src/response/StandaloneGraphQLServerResponseCompat.ts:61:20
             } catch {
                 return response
             }
-        } else if (response instanceof Uint8Array) {
+        } else if (true) {
             const decodedResponse = this.textDecoder.decode(response)
             try {
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected '' to be undefined

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:63:17
             }
         } else if (response instanceof Uint8Array) {
             const decodedResponse = this.textDecoder.decode(response)
-            try {
-                return JSON.parse(decodedResponse)
-            } catch {
+            try {} catch {
                 return decodedResponse
             }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:65:21
             const decodedResponse = this.textDecoder.decode(response)
             try {
                 return JSON.parse(decodedResponse)
-            } catch {
-                return decodedResponse
-            }
+            } catch {}
         } else {
             return response
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[Killed] BlockStatement
src/response/StandaloneGraphQLServerResponseCompat.ts:68:16
             } catch {
                 return decodedResponse
             }
-        } else {
-            return response
-        }
+        } else {}
     }
 }
killedBy: StandaloneGraphQLServerResponse should work as expected
statusReason: expected undefined to be 'Hello, World!' // Object.is equality
